Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropItem.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropItem.Coefficient
The coefficient between the begin connector and end connector, Units: (kg/(ft·s²)).
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropItem.VelocityPressure
The velocity pressure, for converting between coefficient and pressure drop on this flow path. Units: (kg/(ft·s²)).
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropItem.EndConnectorIndex
The index of the end conector of the flow path.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropItem.BeginConnectorIndex
The index of the begin connector of the flow path.
Since:
2014

Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropItem
A flow path of the duct/pipe fitting and accessory. It is defined by the begin connector and end connector.
Since:
2014